-- DB update 2022_03_27_09 -> 2022_03_27_10
DROP PROCEDURE IF EXISTS `updateDb`;
DELIMITER //
CREATE PROCEDURE updateDb ()
proc:BEGIN DECLARE OK VARCHAR(100) DEFAULT 'FALSE';
SELECT COUNT(*) INTO @COLEXISTS
FROM information_schema.COLUMNS
WHERE TABLE_SCHEMA = DATABASE() AND TABLE_NAME = 'version_db_world' AND COLUMN_NAME = '2022_03_27_09';
IF @COLEXISTS = 0 THEN LEAVE proc; END IF;
START TRANSACTION;
ALTER TABLE version_db_world CHANGE COLUMN 2022_03_27_09 2022_03_27_10 bit;
SELECT sql_rev INTO OK FROM version_db_world WHERE sql_rev = '1647999537361228262'; IF OK <> 'FALSE' THEN LEAVE proc; END IF;
--
-- START UPDATING QUERIES
--

INSERT INTO `version_db_world` (`sql_rev`) VALUES ('1647999537361228262');

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(176005, 'ruRU', 'Скамейка подземки', '', 0),
(176006, 'ruRU', 'Скамейка подземки', '', 0),
(176007, 'ruRU', 'Скамейка подземки', '', 0),
(176008, 'ruRU', 'Скамейка подземки', '', 0),
(176009, 'ruRU', 'Скамейка подземки', '', 0),
(176010, 'ruRU', 'Скамейка подземки', '', 0),
(176011, 'ruRU', 'Скамейка подземки', '', 0),
(176012, 'ruRU', 'Скамейка подземки', '', 0),
(176013, 'ruRU', 'Скамейка подземки', '', 0),
(176014, 'ruRU', 'Скамейка подземки', '', 0),
(176015, 'ruRU', 'Скамейка подземки', '', 0),
(176016, 'ruRU', 'Скамейка подземки', '', 0),
(176017, 'ruRU', 'Скамейка подземки', '', 0),
(176018, 'ruRU', 'Скамейка подземки', '', 0),
(176019, 'ruRU', 'Скамейка подземки', '', 0),
(176020, 'ruRU', 'Скамейка подземки', '', 0),
(176021, 'ruRU', 'Скамейка подземки', '', 0),
(176022, 'ruRU', 'Скамейка подземки', '', 0),
(176023, 'ruRU', 'Скамейка подземки', '', 0),
(176024, 'ruRU', 'Скамейка подземки', '', 0),
(176025, 'ruRU', 'Скамейка подземки', '', 0),
(176026, 'ruRU', 'Скамейка подземки', '', 0),
(176027, 'ruRU', 'Скамейка подземки', '', 0),
(176028, 'ruRU', 'Скамейка подземки', '', 0),
(176029, 'ruRU', 'Скамейка подземки', '', 0),
(176030, 'ruRU', 'Скамейка подземки', '', 0),
(176031, 'ruRU', 'Скамейка подземки', '', 0),
(176032, 'ruRU', 'Скамейка подземки', '', 0),
(176033, 'ruRU', 'Скамейка подземки', '', 0),
(176034, 'ruRU', 'Скамейка подземки', '', 0),
(176035, 'ruRU', 'Скамейка подземки', '', 0),
(176036, 'ruRU', 'Скамейка подземки', '', 0),
(176037, 'ruRU', 'Скамейка подземки', '', 0),
(176038, 'ruRU', 'Скамейка подземки', '', 0),
(176039, 'ruRU', 'Скамейка подземки', '', 0),
(176040, 'ruRU', 'Скамейка подземки', '', 0),
(176041, 'ruRU', 'Скамейка подземки', '', 0),
(176042, 'ruRU', 'Скамейка подземки', '', 0),
(176043, 'ruRU', 'Скамейка подземки', '', 0),
(176044, 'ruRU', 'Скамейка подземки', '', 0),
(176045, 'ruRU', 'Скамейка подземки', '', 0),
(176046, 'ruRU', 'Скамейка подземки', '', 0),
(176047, 'ruRU', 'Скамейка подземки', '', 0),
(176048, 'ruRU', 'Скамейка подземки', '', 0),
(176049, 'ruRU', 'Скамейка подземки', '', 0),
(176050, 'ruRU', 'Скамейка подземки', '', 0),
(176051, 'ruRU', 'Скамейка подземки', '', 0),
(176052, 'ruRU', 'Скамейка подземки', '', 0),
(176053, 'ruRU', 'Скамейка подземки', '', 0),
(176054, 'ruRU', 'Скамейка подземки', '', 0),
(176055, 'ruRU', 'Скамейка подземки', '', 0),
(176056, 'ruRU', 'Скамейка подземки', '', 0),
(176057, 'ruRU', 'Скамейка подземки', '', 0),
(176058, 'ruRU', 'Скамейка подземки', '', 0),
(176059, 'ruRU', 'Скамейка подземки', '', 0),
(176060, 'ruRU', 'Скамейка подземки', '', 0),
(176061, 'ruRU', 'Скамейка подземки', '', 0),
(176062, 'ruRU', 'Скамейка подземки', '', 0),
(176063, 'ruRU', 'Скамейка подземки', '', 0),
(176064, 'ruRU', 'Скамейка подземки', '', 0),
(176065, 'ruRU', 'Скамейка подземки', '', 0),
(176066, 'ruRU', 'Скамейка подземки', '', 0),
(176067, 'ruRU', 'Скамейка подземки', '', 0),
(176068, 'ruRU', 'Скамейка подземки', '', 0),
(176069, 'ruRU', 'Скамейка подземки', '', 0),
(176070, 'ruRU', 'Скамейка подземки', '', 0),
(176071, 'ruRU', 'Скамейка подземки', '', 0),
(176072, 'ruRU', 'Скамейка подземки', '', 0),
(176073, 'ruRU', 'Скамейка подземки', '', 0),
(176074, 'ruRU', 'Скамейка подземки', '', 0),
(176075, 'ruRU', 'Скамейка подземки', '', 0),
(176076, 'ruRU', 'Скамейка подземки', '', 0),
(176077, 'ruRU', 'Скамейка подземки', '', 0),
(176078, 'ruRU', 'Скамейка подземки', '', 0),
(176079, 'ruRU', 'Скамейка подземки', '', 0),
(176098, 'ruRU', 'Скамейка подземки', '', 0),
(176099, 'ruRU', 'Скамейка подземки', '', 0),
(176100, 'ruRU', 'Скамейка подземки', '', 0),
(176101, 'ruRU', 'Скамейка подземки', '', 0),
(176102, 'ruRU', 'Скамейка подземки', '', 0),
(176103, 'ruRU', 'Скамейка подземки', '', 0),
(176104, 'ruRU', 'Скамейка подземки', '', 0),
(176105, 'ruRU', 'Скамейка подземки', '', 0),
(176106, 'ruRU', 'Скамейка подземки', '', 0),
(176107, 'ruRU', 'Скамейка подземки', '', 0),
(176108, 'ruRU', 'Скамейка подземки', '', 0),
(176109, 'ruRU', 'Скамейка подземки', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(57748, 'ruRU', 'Фонарный столб', '', 0),
(82139, 'ruRU', 'Фонарный столб', '', 0),
(82140, 'ruRU', 'Фонарный столб', '', 0),
(57709, 'ruRU', 'Фонарный столб', '', 0),
(57710, 'ruRU', 'Фонарный столб', '', 0),
(57725, 'ruRU', 'Фонарный столб', '', 0),
(57726, 'ruRU', 'Фонарный столб', '', 0),
(57727, 'ruRU', 'Фонарный столб', '', 0),
(57749, 'ruRU', 'Фонарный столб', '', 0),
(57750, 'ruRU', 'Фонарный столб', '', 0),
(57751, 'ruRU', 'Фонарный столб', '', 0),
(57752, 'ruRU', 'Фонарный столб', '', 0),
(57753, 'ruRU', 'Фонарный столб', '', 0),
(70518, 'ruRU', 'Фонарный столб', '', 0),
(70519, 'ruRU', 'Фонарный столб', '', 0),
(70520, 'ruRU', 'Фонарный столб', '', 0),
(70521, 'ruRU', 'Фонарный столб', '', 0),
(70522, 'ruRU', 'Фонарный столб', '', 0),
(70523, 'ruRU', 'Фонарный столб', '', 0),
(70524, 'ruRU', 'Фонарный столб', '', 0),
(70525, 'ruRU', 'Фонарный столб', '', 0),
(70526, 'ruRU', 'Фонарный столб', '', 0),
(70527, 'ruRU', 'Фонарный столб', '', 0),
(70528, 'ruRU', 'Фонарный столб', '', 0),
(70530, 'ruRU', 'Фонарный столб', '', 0),
(70531, 'ruRU', 'Фонарный столб', '', 0),
(70532, 'ruRU', 'Фонарный столб', '', 0),
(70533, 'ruRU', 'Фонарный столб', '', 0),
(70534, 'ruRU', 'Фонарный столб', '', 0),
(70535, 'ruRU', 'Фонарный столб', '', 0),
(70536, 'ruRU', 'Фонарный столб', '', 0),
(70537, 'ruRU', 'Фонарный столб', '', 0),
(70538, 'ruRU', 'Фонарный столб', '', 0),
(70539, 'ruRU', 'Фонарный столб', '', 0),
(70540, 'ruRU', 'Фонарный столб', '', 0),
(70541, 'ruRU', 'Фонарный столб', '', 0),
(70542, 'ruRU', 'Фонарный столб', '', 0),
(70543, 'ruRU', 'Фонарный столб', '', 0),
(70544, 'ruRU', 'Фонарный столб', '', 0),
(70545, 'ruRU', 'Фонарный столб', '', 0),
(70546, 'ruRU', 'Фонарный столб', '', 0),
(70547, 'ruRU', 'Фонарный столб', '', 0),
(70548, 'ruRU', 'Фонарный столб', '', 0),
(70549, 'ruRU', 'Фонарный столб', '', 0),
(70551, 'ruRU', 'Фонарный столб', '', 0),
(70552, 'ruRU', 'Фонарный столб', '', 0),
(70553, 'ruRU', 'Фонарный столб', '', 0),
(70554, 'ruRU', 'Фонарный столб', '', 0),
(70555, 'ruRU', 'Фонарный столб', '', 0),
(70556, 'ruRU', 'Фонарный столб', '', 0),
(70557, 'ruRU', 'Фонарный столб', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(142111, 'ruRU', 'Почтовый ящик', '', 0),
(143987, 'ruRU', 'Почтовый ящик', '', 0),
(143988, 'ruRU', 'Почтовый ящик', '', 0),
(143989, 'ruRU', 'Почтовый ящик', '', 0),
(143990, 'ruRU', 'Почтовый ящик', '', 0),
(144570, 'ruRU', 'Почтовый ящик', '', 0),
(153578, 'ruRU', 'Почтовый ящик', '', 0),
(163313, 'ruRU', 'Почтовый ящик', '', 0),
(185471, 'ruRU', 'Почтовый ящик', '', 0),
(142119, 'ruRU', 'Почтовый ящик', '', 0),
(175864, 'ruRU', 'Почтовый ящик', '', 0),
(181639, 'ruRU', 'Почтовый ящик', '', 0),
(187260, 'ruRU', 'Почтовый ящик', '', 0),
(195629, 'ruRU', 'Почтовый ящик', '', 0),
(195624, 'ruRU', 'Почтовый ящик', '', 0),
(195625, 'ruRU', 'Почтовый ящик', '', 0),
(195626, 'ruRU', 'Почтовый ящик', '', 0),
(195628, 'ruRU', 'Почтовый ящик', '', 0),
(195627, 'ruRU', 'Почтовый ящик', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(28611, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(28612, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(171648, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(171649, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(35577, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(35578, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(35580, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(35581, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(35588, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(35589, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(37474, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(37475, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(37480, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(37481, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(37483, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(37484, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(37492, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(37493, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(38024, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0),
(38025, 'ruRU', 'Дворфийский стул с высокой спинкой', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(172943, 'ruRU', 'Могучее пламя', '', 0),
(172998, 'ruRU', 'Могучее пламя', '', 0),
(173000, 'ruRU', 'Могучее пламя', '', 0),
(173124, 'ruRU', 'Могучее пламя', '', 0),
(173201, 'ruRU', 'Могучее пламя', '', 0),
(172999, 'ruRU', 'Могучее пламя', '', 0),
(173001, 'ruRU', 'Могучее пламя', '', 0),
(173002, 'ruRU', 'Могучее пламя', '', 0),
(173003, 'ruRU', 'Могучее пламя', '', 0),
(173004, 'ruRU', 'Могучее пламя', '', 0),
(173126, 'ruRU', 'Могучее пламя', '', 0),
(173228, 'ruRU', 'Могучее пламя', '', 0),
(173229, 'ruRU', 'Могучее пламя', '', 0),
(173230, 'ruRU', 'Могучее пламя', '', 0),
(173231, 'ruRU', 'Могучее пламя', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(32367, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32370, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32396, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32397, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32398, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32399, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32402, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32405, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32410, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32411, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32430, 'ruRU', 'Главные ворота Стальгорна', '', 0),
(32440, 'ruRU', 'Главные ворота Стальгорна', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(142947, 'ruRU', 'Каменный стул', '', 0),
(171674, 'ruRU', 'Каменный стул', '', 0),
(142948, 'ruRU', 'Каменный стул', '', 0),
(171567, 'ruRU', 'Каменный стул', '', 0),
(171568, 'ruRU', 'Каменный стул', '', 0),
(171675, 'ruRU', 'Каменный стул', '', 0),
(171676, 'ruRU', 'Каменный стул', '', 0),
(171677, 'ruRU', 'Каменный стул', '', 0),
(171718, 'ruRU', 'Каменный стул', '', 0),
(171719, 'ruRU', 'Каменный стул', '', 0),
(171720, 'ruRU', 'Каменный стул', '', 0),
(171721, 'ruRU', 'Каменный стул', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(32356, 'ruRU', 'Зал Исследователей', '', 0),
(32360, 'ruRU', 'Зал Исследователей', '', 0),
(32363, 'ruRU', 'Зал Исследователей', '', 0),
(32371, 'ruRU', 'Зал Исследователей', '', 0),
(32408, 'ruRU', 'Зал Исследователей', '', 0),
(32413, 'ruRU', 'Зал Исследователей', '', 0),
(32418, 'ruRU', 'Зал Исследователей', '', 0),
(32421, 'ruRU', 'Зал Исследователей', '', 0),
(32423, 'ruRU', 'Зал Исследователей', '', 0),
(32786, 'ruRU', 'Зал Исследователей', '', 0),
(32788, 'ruRU', 'Зал Исследователей', '', 0),
(32793, 'ruRU', 'Зал Исследователей', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(32372, 'ruRU', 'Великая Кузня', '', 0),
(32373, 'ruRU', 'Великая Кузня', '', 0),
(32374, 'ruRU', 'Великая Кузня', '', 0),
(32375, 'ruRU', 'Великая Кузня', '', 0),
(32378, 'ruRU', 'Великая Кузня', '', 0),
(32379, 'ruRU', 'Великая Кузня', '', 0),
(32392, 'ruRU', 'Великая Кузня', '', 0),
(32395, 'ruRU', 'Великая Кузня', '', 0),
(32436, 'ruRU', 'Великая Кузня', '', 0),
(32789, 'ruRU', 'Великая Кузня', '', 0),
(32790, 'ruRU', 'Великая Кузня', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(19522, 'ruRU', 'Котел', '', 0),
(59529, 'ruRU', 'Котел', '', 0),
(59530, 'ruRU', 'Котел', '', 0),
(177244, 'ruRU', 'Котел', '', 0),
(20878, 'ruRU', 'Котел', '', 0),
(74077, 'ruRU', 'Котел', '', 0),
(141845, 'ruRU', 'Котел', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(188130, 'ruRU', 'Камень Льда', '', 0),
(188134, 'ruRU', 'Камень Льда', '', 0),
(188135, 'ruRU', 'Камень Льда', '', 0),
(188139, 'ruRU', 'Камень Льда', '', 0),
(188145, 'ruRU', 'Камень Льда', '', 0),
(188146, 'ruRU', 'Камень Льда', '', 0),
(188147, 'ruRU', 'Камень Льда', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(9847, 'ruRU', 'Очаг для приготовления пищи', '', 0),
(10388, 'ruRU', 'Очаг для приготовления пищи', '', 0),
(175592, 'ruRU', 'Очаг для приготовления пищи', '', 0),
(175600, 'ruRU', 'Очаг для приготовления пищи', '', 0),
(175604, 'ruRU', 'Очаг для приготовления пищи', '', 0),
(175605, 'ruRU', 'Очаг для приготовления пищи', '', 0),
(184618, 'ruRU', 'Очаг для приготовления пищи', '', 0);

REPLACE INTO `gameobject_template_locale` (`entry`, `locale`, `name`, `castBarCaption`, `VerifiedBuild`) VALUES
(176080, 'ruRU', 'Подземка', '', 0),
(176081, 'ruRU', 'Подземка', '', 0),
(176082, 'ruRU', 'Подземка', '', 0),
(176083, 'ruRU', 'Подземка', '', 0),
(176084, 'ruRU', 'Подземка', '', 0),
(176085, 'ruRU', 'Подземка', '', 0);

--
-- END UPDATING QUERIES
--
UPDATE version_db_world SET date = '2022_03_27_10' WHERE sql_rev = '1647999537361228262';
COMMIT;
END //
DELIMITER ;
CALL updateDb();
DROP PROCEDURE IF EXISTS `updateDb`;
